Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Package ''{0}'' is declared in the unnamed module, but module ''{1}'' does not read it
zh_cn: 包 ''{0}'' 声明于未命名的包，但模块 ''{1}'' 未读取它

source: Package ''{0}'' not found
zh_cn: 包 ''{0}'' 未找到

source: Package Creation Failed
zh_cn: 包创建失败

source: Package Not Found
zh_cn: 包未找到

source: Package and Class Migration
zh_cn: 包和类迁移

source: Package annotations should be in file package-info.java
zh_cn: 包注解应在文件 package-info.java 中

source: Package file
zh_cn: 包文件

source: Package files
zh_cn: 包文件

source: Package is empty: {0}
zh_cn: 包为空：{0}

source: Package lo&cal
zh_cn: 包本地(&C)

source: Package name ''{0}'' does not correspond to the file path ''{1}''
zh_cn: 包名称 ''{0}'' 不对应于文件路径 ''{1}''

source: Package not found: {0}
zh_cn: 找不到包：{0}

source: Package pattern expected
zh_cn: 期望包模式

source: Package reference expected
zh_cn: 期望包引用

source: Package with subpackages
zh_cn: 包和子包

source: Package {0}
zh_cn: 包 {0}

source: Package {0} does not exist.
zh_cn: 包 "{0}" 不存在。

source: Package {0} occurs in package prefixes of the following source folders:
zh_cn: 包 {0} 出现在以下源文件夹的包前缀中：

source: Package-local class {0} will no longer be accessible from {1}
zh_cn: 包本地类 {0} 将不可以从 {1} 访问

source: Packages
zh_cn: 包

source: Packages and classes to record coverage data
zh_cn: 要记录覆盖率数据的包和类

source: Packages to Use Import with '*'
zh_cn: 使用 '*' 导入的包

source: Packages to be moved to {0}
zh_cn: 要移动至 {0} 的包

source: Packaging issues
zh_cn: 打包问题

source: Page $PAGE$ of $TOTALPAGES$
zh_cn: 页 $PAGE$ / $TOTALPAGES$

source: Page Down
zh_cn: 下一页

source: Page Down with Selection
zh_cn: 下翻页并选择

source: Page Up
zh_cn: 上一页

source: Page Up with Selection
zh_cn: 上翻页并选择

source: Page {1} of {2}
zh_cn: 页 {1} / {2}

source: Palette
zh_cn: 调色板

source: Paper size
zh_cn: 纸张大小

source: Parameter
zh_cn: 参数

source: Parameter ''{0}'' is never used
zh_cn: 参数 ''{0}'' 从未使用

source: Parameter <code>#ref</code> can have <code>final</code> modifier
zh_cn: 参数 <code>#ref</code> 可以有 <code>final</code> 修饰符

source: Parameter <code>#ref</code> is not used in either this method or any of its derived methods
zh_cn: 参数 <code> #ref </code> 不用于此方法或其任何衍生方法

source: Parameter <code>#ref</code> is not used in any implementation
zh_cn: 参数 <code>#ref</code> 在任何实现中都未使用

source: Parameter Info
zh_cn: 参数信息

source: Parameter Name Hints
zh_cn: 参数名称提示

source: Parameter Ob_ject...
zh_cn: 参数对象...(_J)

source: Parameter annotated @{0} must not override @{1} parameter
zh_cn: 注解为 @{0} 的参数不得重写 @{1}

source: Parameter annotated @{0} should not override non-annotated parameter
zh_cn: 注解为 @{0} 的参数不应该覆盖非注解参数

source: Parameter annotated @{0} should not receive 'null' as an argument
zh_cn: 注解为 @{0} 的参数不应该接收 'null' 作为参数

source: Parameter annotations
zh_cn: 参数注释

source: Parameter can be converted to a local variable
zh_cn: 参数可以转换为局部变量

source: Parameter can be local
zh_cn: 参数可以是局部的

source: Parameter descriptions on new line
zh_cn: 参数描述另起一行

source: Parameter expected
zh_cn: 期望参数

source: Parameter initializer contains {0}, but not all calls to method are in its class
zh_cn: 参数初始化器包含 {0}，但并不是所有对方法的调用都在其类中

source: Parameter na&me:
zh_cn: 参数名称：(&M)

source: Parameter name expected
zh_cn: 期望参数名称

source: Parameter of &type:
zh_cn: 参数类型:(&T)

source: Parameter:
zh_cn: 参数：

source: Parameters
zh_cn: 参数

source: Parameters Method
zh_cn: 参数方法

source: Parameters in
zh_cn: 参数在

source: Parameters//Implicit anonymous class parameter
zh_cn: 参数//隐式的匿名类参数

source: Parameters//Lambda parameter
zh_cn: 参数//Lambda 参数

source: Parameters//Parameter
zh_cn: 参数//参数

source: Parameters//Reassigned parameter
zh_cn: 变量//重新分配的参数

source: Parameters//Type parameter
zh_cn: 参数//类型参数

source: Parameters:
zh_cn: 参数:

source: Params:
zh_cn: 参数:

source: Parent keymap:
zh_cn: 父级快捷键:

source: Parenthesized expression
zh_cn: 括号表达式

source: Parsing inspections XML dump
zh_cn: 分析检查的 XML 转储

source: Parsing {0}...
zh_cn: 解析 {0}...

source: Part of the changes were moved to active changelist
zh_cn: 部分更改已移至活动更改列表

source: Partial Commit of Active Changelist
zh_cn: 活动更改列表的部分提交

source: Partially included
zh_cn: 部分包含

source: Pass &fields as params
zh_cn: 传递字段作为参数(&F)

source: Pass &outer class' instance as a parameter
zh_cn: 传递外部类的实例作为一个参数(&O)

source: Pass count
zh_cn: 通过数

source: Passed
zh_cn: 通过

source: Passing <code>null</code> argument to parameter annotated as @NotNull
zh_cn: 传递 <code>null</code> 参数给注解为 @NotNull 的参数

source: Password
zh_cn: 密码

source: Past_e from History...
zh_cn: 从历史记录粘贴...(_E)

source: Paste
zh_cn: 粘贴

source: Paste S_imple
zh_cn: 简单粘贴(_I)

source: Paste from X clipboard
zh_cn: 从 X 剪贴板粘贴

source: Paste from clipboard
zh_cn: 从剪贴板粘贴

source: Paste from recent clipboards
zh_cn: 从最近的剪贴板粘贴

source: Paste without formatting, autoimport, literal escaping etc.
zh_cn: 粘贴，不进行格式化，自动导入，文字转义等。

source: Pasting reference
zh_cn: 粘贴引用

source: Patch
zh_cn: 补丁

source: Patch Conflict for {0}
zh_cn: {0} 的补丁冲突

source: Patch file has been created
zh_cn: 补丁文件已创建

source: Patch files
zh_cn: 补丁文件

source: Patch size:
zh_cn: 补丁大小:

source: Patch successfully applied
zh_cn: 成功应用补丁

source: Patched Version
zh_cn: 补丁版本

source: Patched version
zh_cn: 补丁版本

source: Path
zh_cn: 路径

source: Path ''{0}'' is invalid
zh_cn: 路径 ''{0}'' 无效

source: Path Macros
zh_cn: 宏路径

source: Path Variables
zh_cn: 路径变量

source: Path Variables Not Defined
zh_cn: 路径变量未定义

source: Path to "profiles.ini":
zh_cn: 到 "profiles.ini" 的路径:

source: Path to $FileDir$ from parent directory with name passed as a parameter
zh_cn: 来自父目录 $FileDir$ 的路径，其名称作为参数传递

source: Path to executable configured for this project can be set as the global path for all projects or reverted to the current global executable
zh_cn: 为此项目配置的可执行文件的路径可以设置为所有项目的全局路径，或者还原为当前全局可执行文件

source: Path to instance document
zh_cn: 实例文档的路径

source: Path to schema
zh_cn: schema 路径

source: Path to schema or wsdl to be used for generation using XmlBeans
zh_cn: 使用 XmlBeans 用于生成的 schema 或 wsdl 路径

source: Path to {0} module file (.iml):
zh_cn: {0} 模块文件 (.iml)的路径:

source: Path variable "{0}" is undefined
zh_cn: 未定义路径变量 "{0}"

source: Path {0} does not exist
zh_cn: 路径 {0} 不存在

source: Path:
zh_cn: 路径:

source: Paths
zh_cn: 路径

source: Paths Affected in Revision {0}
zh_cn: 修订版 {0} 中影响的路径

source: Paths to be included in compilation bootclasspath
zh_cn: 路径被列入编译 bootclasspath

source: Pattern
zh_cn: 模式

source: Pattern Conversion
zh_cn: 模式转换

source: Pattern argument expected on ''{0}'' option
zh_cn: 期望在 ''{0}'' 选项的模式参数

source: Pattern should be specified
zh_cn: 应指定模式

source: Pattern:
zh_cn: 模式:

source: Patterns
zh_cn: 模式

source: Pause Output
zh_cn: 暂停输出

source: Paused
zh_cn: 暂停

source: Paused in another thread
zh_cn: 在另一个线程中暂停

source: Perform &exhaustive search
zh_cn: 进行详尽的搜索(&E)

source: Perform &update from VCS in background
zh_cn: 在后台执行 VCS 更新(&U)

source: Perform Add/Remove in background
zh_cn: 在后台进行添加/删除

source: Perform Edit/Checkout in background
zh_cn: 在后台执行编辑/检出

source: Perform any build initialization in this target
zh_cn: 在这个目标中执行任何构建初始化

source: Perform backward analysis
zh_cn: 进行逆向分析

source: Perform code analy&sis
zh_cn: 执行代码分析(&S)

source: Perform revert in background
zh_cn: 在后台执行恢复

source: Performance
zh_cn: 性能

source: Performance issues
zh_cn: 性能问题

source: Performing Code Analysis
zh_cn: 执行代码分析

source: Performing VCS refresh...
zh_cn: 执行 VCS 刷新...

source: Performing code analysis
zh_cn: 执行代码分析

source: Performs lazy initialization
zh_cn: 执行延迟初始化

source: Period in the documentation is missing.
zh_cn: 文档中的句号缺少。

source: Permanent ticket obtained
zh_cn: 获得永久授权

source: Permute arguments
zh_cn: 置换参数

source: Personal License
zh_cn: 个人许可证

source: Pin Tab
zh_cn: 固定选项卡

source: Pin active editor or tool window tab
zh_cn: 固定活动工具窗口或编辑器选项卡

source: Pin active editor tab
zh_cn: 固定活动编辑器选项卡

source: Pin active tool window tab
zh_cn: 固定活动工具窗口选项卡

source: Pin tool window tab
zh_cn: 固定工具窗口选项卡

source: Pin/unpin active tool window
zh_cn: 固定/取消固定 活动工具窗口

source: Pla_y Back Last Macro
zh_cn: 回放上一个宏(_Y)

source: Place ')' on new line
zh_cn: ')' 另起一行

source: Place ']' on new line
zh_cn: ']' 另起一行

source: Place '}' on new line
zh_cn: '}' 另起一行

source: Place on New Line
zh_cn: 放在新行

source: Placement
zh_cn: 定位

source: Placement:
zh_cn: 布局:

source: Platform and Plugin Updates
zh_cn: 平台和插件更新

source: Play Back last used macro
zh_cn: 播放上次使用的宏

source: Play Saved Macros
zh_cn: 播放保存的宏

source: Play Saved Macros...
zh_cn: 播放保存的宏...

source: Playback Debugger
zh_cn: Playback 调试器

source: Please Correct "New Method Body" Template
zh_cn: 请更正 "new 方法体" 模板

source: Please Correct "Overridden/Implemented Method Body" Template
zh_cn: 请更正 "Overridden/Implemented Method Body" 模板

source: Please Enter a Valid name for Parameter
zh_cn: 请输入一个有效的参数名称

source: Please add all the needed paths to API docs in Project Settings.
zh_cn: 请在“项目设置”中将所有需要的路径添加到 API 文档。

source: Please check all components to import:
zh_cn: 请检查所有要导入的组件：

source: Please check network connection and try again.
zh_cn: 请检查网络连接，然后重试。

source: Please check the settings to export:
zh_cn: 请选择要导出的设置:

source: Please choose a different abbreviation or group.
zh_cn: 请选择其他缩写或组。

source: Please choose directories that will be added to the project roots.
zh_cn: 请选择将要被添加到项目根的目录。

source: Please choose directories that will be marked as source paths.
zh_cn: 请选择将要标记为源路径的目录。

source: Please configure library ''{0}'' which is used in module ''{1}''
zh_cn: 请配置模块 ''{1}'' 中使用的库 ''{0}''

source: Please consider switching to the bundled Java runtime that is better suited for the IDE (your current Java runtime is {0}).
zh_cn: 请考虑切换到更适合 IDE 的自带 Java 运行环境(您当前的 Java 运行环境为 {0} )。

source: Please consider switching to the bundled Java runtime, or updating to {1} or newer.
zh_cn: 请考虑切换到软件自带的 Java 运行环境，或更新到 {1} 或更新版本。

source: Please define the association:
zh_cn: 请定义关联：

source: Please do "Save As..." first.
zh_cn: 请先做 "另存为..."。

source: Please enter a file name
zh_cn: 请输入文件名

source: Please enter a name for the changelist:
zh_cn: 请输入更改列表的名称：

source: Please enter a name to create a new {0} {1}.
zh_cn: 请输入名称以创建新的 {0} {1}。

source: Please enter a valid name for inverted {0}
zh_cn: 请为反转的 {0} 输入一个有效的名字

source: Please enter a valid target package name
zh_cn: 请输入一个有效的目标包名称

source: Please enter library name
zh_cn: 请输入库名称

source: Please enter your password to create a desktop entry
zh_cn: 请输入您的密码来创建桌面项

source: Please enter your password to create a launcher script in a ''{0}''
zh_cn: 请输入您的密码以创建一个启动脚本在一个 ''{0}''

source: Please make sure you have generated the file using 'File|Export Settings' feature.
zh_cn: 请确保是已使用 '文件|导出设置' 功能生成的文件。

source: Please note that this channel is less stable than your current one.
zh_cn: 请注意，这个通道没有你当前的稳定。

source: Please perform usage search again.
zh_cn: 请再次执行使用搜索。

source: Please point the caret inside Java string literal or select part of it.
zh_cn: 请将插入符指向 Java 字符串文字或选择其中的一部分。

source: Please quit the IDE and apply the patch manually by launching this script: {0}.
zh_cn: 请退出 IDE，并通过启动此脚本手动应用该修补程序： {0}。

source: Please refresh it (via Tools | Create Command-line Launcher).
zh_cn: 请刷新它(通过工具|创建命令行启动)。

source: Please report the problem to plugin vendor.
zh_cn: 请将问题报告给插件供应商。

source: Please report the problem to plugin vendor:
zh_cn: 请将问题报告给插件供应商：

source: Please review the following items and exclude mistakenly detected.</body></html>
zh_cn: 请检查以下项目，并排除错误检测。</body></html>

source: Please run it by a privileged user to update.
zh_cn: 请由特权用户进行更新。

source: Please select JSP text to I18nize.
zh_cn: 请选择 JSP 文本进行国际化。

source: Please select previous {0} config folder or installation home
zh_cn: 请选择以前的 {0} 配置文件夹或安装目录

source: Please select previous {1} installation home
zh_cn: 请选择以前 {1} 的安装回家

source: Please select project SDK.
zh_cn: 请选择项目 SDK。

source: Please select the element for which you wish to view the documentation
zh_cn: 请选择您要查看文档的元素

source: Please select the {0} to be set for this module
zh_cn: 请为此模块选择要设置的 {0}

source: Please set a property here
zh_cn: 请在这里设置一个属性

source: Please setup correct JDK.
zh_cn: 请设置正确的 JDK。

source: Please specify SDK name
zh_cn: 请指定 SDK 名称

source: Please specify a correct file name.
zh_cn: 请指定正确的文件名。

source: Please specify a different SDK name
zh_cn: 请指定不同的 SDK 名称

source: Please specify a directory where source files for your project can be found.
zh_cn: 请指定可以找到项目的源文件的目录。

source: Please specify a path to web browser in {0} | Web Browsers
zh_cn: 请在 {0} | Web 浏览器 里指定一个网络浏览器的路径

source: Please specify module file location
zh_cn: 请指定模块文件位置

source: Please specify module name
zh_cn: 请指定模块名

source: Please specify module name and module content root.
zh_cn: 请指定模块名称和模块内容根。

source: Please specify path to {0} module file (.iml)
zh_cn: 请指定 {0} 模块文件 (.iml) 的路径

source: Please specify properties file path
zh_cn: 请指定属性的文件路径

source: Please specify template extension
zh_cn: 请指定模板扩展名

source: Please specify template name
zh_cn: 请指定模板名称

source: Please update to {1} or newer
zh_cn: 请更新为 {1} 或更新

source: Please update to {1} or newer, or <a href="switch">switch</a> to the bundled Java runtime
zh_cn: 请更新到 {1} 或更新版本，或<a href="switch">切换</a>到内置的 Java 运行环境

source: Please update to {1} or newer.
zh_cn: 请更新至 {1} 或更新版本。

source: Please update your settings in the Project Structure dialog.
zh_cn: 请在项目结构对话框中更新设置。

source: Please update your settings in the Project | Libraries menu.
zh_cn: 请在 Project | Libraries （项目 | 库）菜单更新设置。

source: Please upgrade, otherwise you won't be able to restart the IDE.
zh_cn: 请升级，否则将无法重新启动 IDE。

source: Please use stable release.
zh_cn: 请使用稳定版本。

source: Please wait until VCS synchronization is finished.
zh_cn: 请等待 VCS 同步完成。

source: Please wait.
zh_cn: 请等待。

source: Please, specify new name for scheme ''{0}''.
zh_cn: 请为方案 ''{0}'' 指定新名称。

source: Please, specify sdk ''{0}'' for module ''{1}''
zh_cn: 请为模块 ''{1}'' 指定 sdk ''{0}''

source: Please, try again.
zh_cn: 请再试一次。

source: Plug-ins
zh_cn: 插件

source: Plugin "{0}" was not loaded: required plugin "{1}" is disabled.
zh_cn: 插件 "{0}" 未加载: 必需的插件 "{1}" 被禁用。

source: Plugin "{0}" was not loaded: required plugin "{1}" not installed.
zh_cn: 插件 "{0}" 未加载: 必需的插件 "{1}" 未安装。

source: Plugin Dependencies Detected
zh_cn: 检测到插件依赖关系

source: Plugin Development
zh_cn: 插件开发

source: Plugin Error
zh_cn: 插件错误

source: Plugin Uninstall
zh_cn: 插件卸载

source: Plugin download failed
zh_cn: 插件下载失败

source: Plugin home page
zh_cn: 插件主页

source: Plugin is incompatible with current {0} installation
zh_cn: 插件与当前的 {0} 安装不兼容

source: Plugin was uninstalled; changes will be applied on restart
zh_cn: 插件已卸载; 更改将在重新启动时应用

source: Plugin was updated to the newest version; changes will be applied on restart
zh_cn: 插件更新到最新版本; 更改将在重新启动时应用

source: Plugin will be activated after restart
zh_cn: 插件将在重启后被激活

source: Plugin {0} was not installed: {1}
zh_cn: 插件 {0} 没有安装: {1}

source: Plugins
zh_cn: 插件

source: Plugins Changed
zh_cn: 插件已更改

source: Plugins should not have cyclic dependencies:
zh_cn: 插件不应该有循环依赖:

source: Popup path of the current file for opening in external file manager
zh_cn: 弹出当前文件路径以便外部文件管理器打开

source: Popup structure of the current file for quick navigation
zh_cn: 弹出当前文件的结构，用于快速导航

source: Popup this window immediately next time internal error occurs
zh_cn: 下次发生内部错误时,立即弹出这个窗口

source: Popups and Hints//Documentation
zh_cn: 弹出窗口和提示//文档

source: Popups and Hints//Error hint
zh_cn: 弹出窗口和提示//错误提示

source: Popups and Hints//Information hint
zh_cn: 弹出窗口和提示//信息提示

source: Popups and Hints//Question hint
zh_cn: 弹出窗口和提示//问题提示

source: Popups and Hints//Tooltip
zh_cn: 弹出窗口和提示//工具提示

source: Port &number:
zh_cn: 端口号:(&N)

source: Port is not specified
zh_cn: 未指定端口

source: Port:
zh_cn: 端口:

source: Portability
zh_cn: 可移植性

source: Portability issues
zh_cn: 可移植性问题

source: Portrait
zh_cn: 纵向

source: Position the caret at the selector to be renamed and press &shortcut:RenameElement; (Refactor | Rename).
zh_cn: 将插入符号定位到要重命名的选择器，然后按 &shortcut:RenameElement; (Refactor | Rename)。

source: Position to an element to find usages for, and try again.
zh_cn: 定位到要查找用法的元素，然后再试一次。

source: Poster Columns
zh_cn: Poster 列

source: Poster Rows
zh_cn: Poster 行

source: Postfix Completion
zh_cn: 后缀补全

source: Postfix code completion is applied "from right to left" and lets you avoid backward caret jumps when coding.
zh_cn: 后缀代码补全是从 "从右到左" 的应用，允许您在编码时避免插入符号往回跳转。

source: Postfix completion
zh_cn: 后缀补全

source: Postfix completion invocation result will be shown here.
zh_cn: 后缀补全执行的结果将显示在这里。

source: Postpone
zh_cn: 推迟

source: Potentially confusing code constructs
zh_cn: 可能引起混淆的代码结构

source: Potentially unsafe to delete references found in code
zh_cn: 在代码中删除引用可能不安全

source: Power Save Mode
zh_cn: 省电模式

source: Power save mode disables background code analysis and other background operations
zh_cn: 省电模式禁用后台码分析和其他后台操作

source: Powered by
zh_cn: 提供者

source: Pr&eserve case
zh_cn: 保留大小写(&E)

source: Pr&ivate
zh_cn: 私有(&I)

source: Pr&otected
zh_cn: 受保护(&O)

source: Prefer comma separated import list
zh_cn: 首选逗号来分隔导入列表

source: Prefer key position over key char with national layout
zh_cn: 在 national 布局上键位优先于键字符

source: Prefer longer names
zh_cn: 更喜欢较长的名称

source: Prefer one import statement per page directive
zh_cn: 偏好每页指令一个 import 语句

source: Preferences
zh_cn: 首选项

source: Preferences...
zh_cn: 首选项...

source: Prefix Key Pressed.
zh_cn: 按下前缀键。

source: Preparing Code
zh_cn: 准备代码

source: Preparing Patch Files
zh_cn: 准备补丁文件

source: Preparing imports...
zh_cn: 准备导入...

source: Preparing to Apply Fix...
zh_cn: 准备应用修复...

source: Preparing...
zh_cn: 准备中...

source: Preselect old name
zh_cn: 预选旧名称

source: Presentation Mode
zh_cn: 演示模式

source: Presentational HTML tag
zh_cn: 显示的 HTML 标签

source: Preserve line feeds
zh_cn: 保留换行

source: Preserve raw &arrays
zh_cn: 保留原始数组(&A)

source: Press ''{2}'' to accept entered patterns, ''{3}'' to load default patterns in new format.
zh_cn: 按 ''{2}'' 接受输入的模式，''{3}'' 以新格式加载默认模式。

source: Press 'Show Help' for more information.
zh_cn: 按 '显示帮助' 了解更多信息。

source: Press 'Skip' to show all settings
zh_cn: 按 '跳过' 显示所有设置

source: Press &shortcut:EditorContextInfo; (View | Context Info) to see the declaration of the current method without the need to scroll to it.
zh_cn: 按下 &shortcut:EditorContextInfo; (View | Context Info) 查看当前方法的申明而不需要滚动到方法声明处。

source: Press &shortcut:EditorEscape; to remove all the additional cursors but one that resides at the line at caret.
zh_cn: 按 &shortcut:EditorEscape; 移除所有额外的光标，除了位于插入符号处的。

source: Press &shortcut:EditorEscape; to remove highlighting.
zh_cn: 按 &shortcut:EditorEscape; 移除高亮。

source: Press &shortcut:ExtractMethod; (Refactor | Extract | Method).
zh_cn: 按 &shortcut:ExtractMethod;(Refactor | Extract | Method)。

source: Press &shortcut:GotoAction; (Help | Find Action) and enter the name of the action.
zh_cn: 按 &shortcut:GotoAction;(Help | Find Action)并输入操作的名称。

source: Press &shortcut:GotoImplementation; (Navigate | Implementations) or &shortcut:ShowIntentionActions;, and then choose the corresponding intention action.
zh_cn: 按 &shortcut:GotoImplementation;(Navigate | Implementations)或 &shortcut:ShowIntentionActions;，然后选择相应的意图操作。

source: Press &shortcut:NewScratchFile; (File | New | Scratch File) and confirm the file type.
zh_cn: 按 &shortcut:NewScratchFile;(File | New | Scratch File)并确认文件类型。

source: Press &shortcut:OptimizeImports; (Code | Optimize Imports) or &shortcut:ShowIntentionActions; (when the caret is on the import statement), and then choose the corresponding quick-fix.
zh_cn: 按 &shortcut:OptimizeImports;(Code | Optimize Imports)或 &shortcut:ShowIntentionActions;(当插入符号位于导入语句中时) ，然后选择相应的快速修复。

source: Press &shortcut:QuickJavaDoc; (View | Quick Documentation) to see the documentation for a function, type, package, or any other symbol at the caret.
zh_cn: 按 &shortcut:QuickJavaDoc;(View | Quick Documentation)查看插入符号处的函数，类型，包或任何其他符号的文档。

source: Press &shortcut:Refactorings.QuickListPopupAction; (Refactor | Refactor This) and choose the one you need.
zh_cn: 按 &shortcut:Refactorings.QuickListPopupAction;(Refactor | Refactor This)并选择你需要的。

source: Press &shortcut:ViewBreakpoints; to show all the existing breakpoints, then right-click the breakpoint you want to give a description, and choose Edit description:
zh_cn: 按 &shortcut:ViewBreakpoints; 查看所有现有的断点，然后右击你想要添加描述的断点，选择 Edit description ：

source: Press &shortcut:ActivateTerminalToolWindow;, and see the terminal running.
zh_cn: 按下 &shortcut:ActivateTerminalToolWindow; 并查看终端运行。

source: Press Escape to remove the highlighting
zh_cn: 按 Esc 移除高亮显示

source: Press Refresh button to load incoming changes
zh_cn: 按刷新按钮加载传入的更改

source: Press Refresh button to load repository changes
zh_cn: 按刷新按钮加载仓库更改

source: Press the
zh_cn: 按

source: Press the "Find usages" button to find all usages and the "Do Move" button of the search results panel to finish the movement operation.
zh_cn: 按下 "Find usages" 按钮找到所有使用，在搜索结果面板按下 "Do Move" 按钮来完成移动操作。

source: Press the "Do Migrate" button at the bottom of the search results panel to migrate using the migration map "{0}"
zh_cn: 按“搜索结果”面板底部的“迁移”按钮，来使用迁移地图“{0}”迁移

source: Press the right mouse button to see the list of available macros
zh_cn: 按鼠标右键可查看可用宏的列表

source: Press {0} again to search for all matching project files
zh_cn: 再次按 {0} 搜索所有匹配的项目文件

source: Press {0} again to view all accessible classes
zh_cn: 再按 {0} 查看所有可访问的类

source: Press {0} once more to find arrays of {1}
zh_cn: 再按 {0} 查找 {1} 的数组

source: Press {0} once more to find collections of {1}
zh_cn: 再按 {0} 查找 {1} 的集合

source: Press {0} once more to ignore module dependencies while searching
zh_cn: 再按 {0} 在搜索时忽略模块依赖

source: Press {0} once more to search across chained method calls
zh_cn: 再按 {0} 搜索链式的方法调用

source: Press {0} or {1} to navigate through the history
zh_cn: 按 {0} 或 {1} 浏览历史记录

source: Press {0} to navigate through the history
zh_cn: 按 {0} 浏览历史记录

source: Press {0} to search for matching files of any type
zh_cn: 按 {0} 搜索任何类型的匹配文件

source: Press {0} to show only variants that are suitable by type
zh_cn: 按 {0} 显示仅适用于类型的变量

source: Press {0} to view tags from other namespaces
zh_cn: 按 {0} 查看其他命名空间的标签

source: Pressing &shortcut:CommentByBlockComment; for a selected block of source code in a Django template surrounds the block with {% comment %} and {% endcomment %} tags.
zh_cn: 按 &shortcut:CommentByBlockComment; 使用 Django 模板包围一个源码块，用 {% comment %} 和 {% endcomment %} 标签。

source: Pressing &shortcut:HippieCompletion; helps complete words in the visible scope - so doing, the prototypes are highlighted.
zh_cn: 使用 &shortcut:HippieCompletion; 来在可视范围内补全单词，这样做的话，补全的原型将会高亮。

source: Pressing &shortcut:JumpToLastChange; a few times moves you deeper into your changes history.
zh_cn: 按 &shortcut:JumpToLastChange; 多次可以让你深入到你的更改历史中。

source: Pressing &shortcut:CodeCompletion; once more to view all accessible classes.
zh_cn: 再按一次 &shortcut:CodeCompletion; ，查看所有可访问的类。

source: Pressing &shortcut:Replace; adds field, where you can type the replace string.
zh_cn: 按下 &shortcut:Replace; 添加字段，你可以输入替换字符串。

source: Pressing the same shortcut after you have invoked Smart-type Completion when a collection type is expected will search for arrays with same component type and suggest to convert them using Arrays.asList() call.
zh_cn: 调用智能类型补全后，如果预期一个集合类型，按下相同的快捷方式，将搜索具有相同组件类型的数组，并建议使用 Arrays.asList() 转换它们。

source: Pressing the same shortcut after you have invoked Smart-type Completion when an array type is expected will search for collections with same component type and suggest to convert them using toArray() call.
zh_cn: 调用智能类型补全后，如果预期一个数组类型，按下相同的快捷方式，将搜索具有相同组件类型的集合，并建议使用 toArray() 转换它们。

source: Pressing the same shortcut after you have invoked Smart-type Completion when there's an array of expected type in context will suggest to get an element from this array.
zh_cn: 调用智能类型补全后，当上下文中有一个预期类型的数组时，再按相同的快捷方式，将建议从该数组中获取元素。
